const qnaList = [
    {
        q: '1.어떤 단과대 소속인가요?',
        a: [
            {answer: '글로벌융합대학', score: 2},
            {answer: '과학기술대학', score: 2},
            {answer: 'Art&Design대학', score: 4}
        ]
    },
    {
        q: '2.어떤 방식이 더 공부가 잘되나요?',
        a: [
            {answer: '노트북', score: 2},
            {answer: '손필기', score: 2},
            {answer: '태블릿필기', score: 4},
            {answer: '필기 따윈 하지 않는다', score: 6}
        ]
    },
    {
        q: '3.한가지 항목으로만 평가받을 수 있다면?',
        a: [
            {answer: '과제', score: 6},
            {answer: '시험', score: 4},
            {answer: '토론', score: 7}
        ]
    },
    {
        q: '4.내일 시험이 연달아 3개일 때 밤샘공부를 한다면?',
        a: [
           {answer: '같이 한다', score: 4},
           {answer: '혼자 한다', score: 2}
        ]
    },
    {
        q: '5.어떤 교수님이 더 좋나요?',
        a: [
            {answer: '너무 친해서 새벽에 카톡해도 이상하지 않은 교수님', score: 4},
            {answer: '복도에서 마주치면 눈피하는 교수님', score: 6}
        ]
    },
    {
        q: '6.참여하고 싶은 활동은?',
        a: [
            {answer: '신춘문예', score: 6},
            {answer: '디자인 공모전', score: 4},
            {answer: '해커톤', score: 3},
            {answer: '마케팅 공모전', score: 5},
            {answer: '봉사', score: 5}
        ]
    },
    {
        q: '7.친구들과 토론한다면 어떤 주제로 하고싶나요?',
        a: [
            {answer: '사회문제', score: 400},
            {answer: '복지', score: 500},
            {answer: '과학기술', score: 700},
            {answer: '외교', score: 100},
            {answer: '경제', score: 300},
            {answer: '예술', score: 1000}
        ]
    },
    {
        q: '8.어떤 수업이 더 좋은가요?',
        a: [
            {answer: '배우는 내용은 없지만 A+ 주는 수업', score: 6},
            {answer: '배우는 내용이 알차지만 B+ 주는 수업', score: 4}
        ]
    },
    {
        q: '9.친구가 카페에서 들고오던 커피를 쏟았다. 당신의 반응은?',
        a: [
            {answer: '컵을 걱정한다', score: 6},
            {answer: '친구를 걱정한다', score: 2}
        ]
    },
    {
        q: '10.전공 선택에 있어서 취업이 중요한가?',
        a: [
            {answer: '중요하다', score: 6},
            {answer: '아니다', score: 2}
        ]
    },
    {
        q: '11.선호하는 영화 장르는?',
        a: [
            {answer: '독립영화', score: 6},
            {answer: '사극', score: 7},
            {answer: '로맨스', score: 0},
            {answer: '스릴러', score: 0},
            {answer: 'SF', score: 3},
            {answer: '공포', score: 0},
            {answer: '코미디', score: 0}
        ]
    },
    {
        q: '12.사람을 정해서 태어날 수 있다면 어떤 사람이 되고싶나요?',
        a: [
            {answer: '세종대왕', score: 7},
            {answer: '스티브잡스', score: 6},
            {answer: '부처님', score: 4},
            {answer: '피카소', score: 2},
            {answer: '지금의 내가 좋다', score: 1}
        ]
    }
]

const infoList = [
    {
        from: 100,
        to: 114,
        mLeft: '2.6%',
        name: '국어국문학전공',
        //어문
        desc: '어문 ㅇ머ㅣㄶ머ㅣㅏㄴㅁㅎㄶ모몬'
    },
    {
        from: 115,
        to: 128,
        mLeft: '5.2%',
        name: '일어일문학전공',
        //어문
        desc: '어문 모ㅗㅁㄹ로조모고모'
    },
    {
        from: 129,
        to: 142,
        mLeft: '7.8%',
        name: '중어중문학전공',
        //어문
        desc: '어문 ㅁ조더어머날ㅇㄹ호'
    },
    {
        from: 41,
        to: 50,
        mLeft: '10.4%',
        //어문
        name: '영어영문학전공',
        desc: '어문 껑미라ㅓㅣㅇ너허해ㅔㅁ'
    },
    {
        from: 143,
        to: 156,
        mLeft: '12.9%',
        //어문--
        name: '불어불문학전공',
        desc: '어문 ㅁ헌아ㅣ허매데ㅓㅋ허ㅡㅌ'
    },
    {
        from: 157,
        to: 170,
        mLeft: '15.4%',
        //어문--
        name: '독어독문학전공',
        desc: '어문 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 171,
        to: 184,
        mLeft: '17.9%',
        //어문--
        name: '스페인어전공',
        desc: '어문 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 185,
        to: 199,
        mLeft: '20.4%',
        //역사--
        name: '사학전공',
        desc: '역사 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 200,
        to: 249,
        mLeft: '23%',
        //역사
        name: '미술사학전공',
        desc: '역사 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '25.6%',
        //상경
        name: '경영학전공',
        desc: '상경 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '28.2%',
        //상경
        name: '회계학전공',
        desc: '상경 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '30.8%',
        //상경
        name: '국제통상학전공',
        desc: '상경 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '33.3%',
        //사회과학--
        name: '철학전공',
        desc: '사회과학 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '35.8%',
        //사회과학--
        name: '문화인류학전공',
        desc: '사회과학 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '38.4%',
        //사회과학
        name: '법학전공',
        desc: '사회과학 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '41%',
        //사회과학
        name: '정치외교학전공',
        desc: '사회과학 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '43.5%',
        //사회과학--
        name: '사회학전공',
        desc: '사회과학 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '46%',
        //복지--
        name: '아동가족학전공',
        desc: '복지 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '48.6%',
        //복지
        name: '사회복지학전공',
        desc: '복지 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '51.2%',
        //복지
        name: '유아교육과',
        desc: '복지 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '53.8%',
        //복합
        name: '문헌정보학전공',
        desc: '복합 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '56.4%',
        //복합
        name: '심리학전공',
        desc: '복합 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '59%',
        //코딩
        name: '컴퓨터공학전공',
        desc: '코딩 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '61.6%',
        //코딩
        name: 'IT미디어공학전공',
        desc: '코딩 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '64.2%',
        //코딩
        name: '사이버보안전공',
        desc: '코딩 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '66.8%',
        //코딩
        name: '소프트웨어전공',
        desc: '코딩 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '69.4%',
        //자연
        name: '수학전공',
        desc: '자연 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '72%',
        //자연
        name: '화학전공',
        desc: '자연 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '74.6%',
        //공학
        name: '바이오공학전공',
        desc: '공학 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '77.2%',
        //공학
        name: '정보통계학전공',
        desc: '공학 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '79.8%',
        //공학
        name: '식품영양학전공',
        desc: '공학 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '82.4%',
        //생체
        name: '생활체육학전공',
        desc: '생체 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '84.9%',
        //순수미술--
        name: '동양화전공',
        desc: '순수미술 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '87.4%',
        //순수미술--
        name: '서양화전공',
        desc: '순수미술 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '90%',
        //디자인
        name: '의상디자인전공',
        desc: '디자인 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '92.5%',
        //디자인--
        name: '실내디자인전공',
        desc: '디자인 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '95%',
        //디자인--
        name: '시각디자인전공',
        desc: '디자인 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    },
    {
        from: 61,
        to: 70,
        mLeft: '97.5%',
        //디자인--
        name: '텍스타일디자인전공',
        desc: '디자인 마ㅚ;ㅓ개ㅔ모ㅓㅣㄴ;읔;ㅌㅊ'
    }
]
